Revit 2024 API
StairsLanding.IsAutomaticLanding Property
 True if the landing is an automatic landing, False otherwise.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public bool IsAutomaticLanding { get; }
Visual Basic
Public ReadOnly Property IsAutomaticLanding As Boolean
	Get
Visual C++
public:
property bool IsAutomaticLanding {
	bool get ();
}
See Also
StairsLanding Class
Autodesk.Revit.DB.Architecture Namespace